// Вывести на экран последнюю цифру целого числа введенного с клавиатуры.
int a=2158;

int c=a%10;

System.Console.WriteLine(c);